### Terraform plan

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.identity_center_users.aws_identitystore_group_membership.memberships["joe.burton@kjr.com.au/llm-testing-admins"] will be created
  + resource "aws_identitystore_group_membership" "memberships" {
      + group_id          = "a99ec4e8-e071-70c1-c534-bd2d2160f5cd"
      + id                = (known after apply)
      + identity_store_id = "d-9767aeefa5"
      + member_id         = (known after apply)
      + membership_id     = (known after apply)
      + region            = "ap-southeast-2"
    }

  # module.identity_center_users.aws_identitystore_user.users["joe.burton@kjr.com.au"] will be created
  + resource "aws_identitystore_user" "users" {
      + display_name      = "Joe Burton"
      + external_ids      = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9767aeefa5"
      + region            = "ap-southeast-2"
      + user_id           = (known after apply)
      + user_name         = "joe.burton@kjr.com.au"

      + emails {
          + primary = true
          + value   = "joe.burton@kjr.com.au"
        }

      + name {
          + family_name = "Burton"
          + given_name  = "Joe"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ user_ids        = {
      + "joe.burton@kjr.com.au"    = (known after apply)
        # (3 unchanged attributes hidden)
    }

```